#### python time, time.time 관련된 부분 python_함수에서 찾아서 하기

- 참고 : https://ellun.tistory.com/320
- https://docs.python.org/ko/3/library/datetime.html

In [7]:
# timestamp -> str
import time 
print(time.time()) #1970년대 어쩌구
type(time.time())
timestamp = time.time()
s = str(timestamp) #time을 문자로 만들어줄 필요가 있을 때 바꿔줄 수 있다.
print(s,type(s))

1626765812.9522061
1626765812.955622 <class 'str'>

In [8]:
# datetime->str로 바꾸기
from datetime import datetime
s = datetime.now()
print(s,type(s))

s1 = datetime.now().strftime('%Y-%m-%d %H:%M:%S')  #string+format = strf
print(s1,type(s1))    #얘는 str이니까 날짜 계산이 안되는 것임

2021-07-20 16:23:37.153297 <class 'datetime.datetime'>
2021-07-20 16:23:37 <class 'str'>

In [14]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:14:12'
s2 = datetime.strptime(s, '%Y-%m-%d %H:%M:%S') #string parsing

print(s2, type(s2))

2021-07-20 11:14:12 <class 'datetime.datetime'>

In [8]:
# str -> timestamp로 바꾸기
import time
from datetime import datetime
s = '2021-07-20 11:14:12'

#str을 datetime으로 바꾼 후 mk함수에 집어넣어줘서 timetuple로 뽑아주는 것. 그래서 timestamp로 바꿈

timestamp = time.mktime(datetime.strptime(s, '%Y-%m-%d %H:%M:%S').timetuple()) 
print(timestamp,type(timestamp))

1626747252.0 <class 'float'>

In [16]:
# datetime -> timestamp
datetime.today()

timestamp = time.mktime(datetime.today().timetuple())

print(timestamp, type(timestamp))

1626765850.0 <class 'float'>

In [17]:
# timestamp -> datetime으로 바꾸기
t = time.time() #timestamp
print(t)
d = datetime.fromtimestamp(t)

print(d, type(d))

1626765852.184001
2021-07-20 16:24:12.184001 <class 'datetime.datetime'>

In [19]:
# 판다스 to_datetime
import pandas as pd
pd.to_datetime(1626751314.443421, unit='s')

# 출력이 timestamp라고 되기는 하지만, datetime임 판다스에서의 datetime임
# to_datetime은 float(파이썬의 datetime형식)를 datetime으로 바꿔줌

Timestamp('2021-07-20 03:21:54.443420928')

In [20]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now = datetime.now()
delta_datetime = timedelta(days=-365)

print(delta_datetime)

one_year_ago = datetime_now + delta_datetime
one_year_ago

-365 days, 0:00:00

datetime.datetime(2020, 7, 20, 16, 30, 50, 17288)

In [87]:
# 두 날짜간의 일수 구하기
since_timestamp = datetime.strptime('20180301', '%Y%m%d')
until_timestamp = datetime.strptime('20180331', '%Y%m%d')

a = until_timestamp - since_timestamp

print(a, type(a))

30 days, 0:00:00 <class 'datetime.timedelta'>

In [89]:
print(type(since_timestamp),since_timestamp)

<class 'datetime.datetime'> 2018-03-01 00:00:00

In [22]:
# 특정일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()]

get_yoil(2021,7,20)

'TUE'

In [23]:
import pandas as pd
date = pd.Timestamp(1626747925.0, unit='s',tz='Asia/Seoul')
#timezone을 아시아/서울로해서 1970년대 어쩌구 시간이 우리나라 시간으로 치환돼서 나오는 것임. unit='s'는 seconds, 초
print(date,type(date))

2021-07-20 11:25:25+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [29]:
import pandas as pd
df = pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [25]:
df.info() #date가 object 즉, 문자로 돼 있음 변환해줘야함

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [26]:
# df = ['N']

# df.info()

In [30]:
df['New_Date'] = pd.to_datetime(df['Date'])
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB
None

In [31]:
df.drop('Date',axis=1, inplace=True) #Date 항목삭제

df['year'] = df['New_Date'].dt.year  #년도만 추출
df['month'] = df['New_Date'].dt.month #달만 추출
df['day'] = df['New_Date'].dt.day #일만 추출

df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [32]:
df.set_index('New_Date',inplace=True)
df.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [7]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 20 entries, 2018-07-02 to 2018-06-01
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   20 non-null     int64
 1   Start   20 non-null     int64
 2   High    20 non-null     int64
 3   Low     20 non-null     int64
 4   Volume  20 non-null     int64
 5   year    20 non-null     int64
 6   month   20 non-null     int64
 7   day     20 non-null     int64
dtypes: int64(8)
memory usage: 1.4 KB

In [34]:
df_ymd_range=df['2018-06-29':'2018-06-26']

df_ymd_range

Empty DataFrame
Columns: [Close, Start, High, Low, Volume, year, month, day]
Index: []

In [35]:
df_ym=df.loc['2018-07', 'Start':'High']
df_ym

            Start   High
New_Date
2018-07-02  10850  10900

In [36]:
df

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26
2018-06-25  11150  11400  11450  11000   55519  2018      6   25
2018-06-22  11300  11250  11450  10750  134805  2018      6   22
2018-06-21  11200  11350  11750  11200  133002  2018      6   21
2018-06-20  11550  11200  11600  10900  308596  2018      6   20
2018-06-19  11300  11850  11950  11300  180656  2018      6   19
2018-06-18  12000  13400  13400  12000  309787  2018      6   18
2018-06-15  13400  13600  13600  12900  201376  2018      6   15
2018-06-14  13450  13200  13700  13150  347451  2018      6   14
2018-06-12  13200  12200  13300  12050  558148  2018      6   12
2018-06-11  11950  12000  12250  11950   62293  2018      6   11
2018-06-08  11950  11950  12200  11800   59258  2018      6    8
2018-06-07  11950  12200  12300  11900   49088  2018      6    7
2018-06-05  12150  11800  12250  11800   42485  2018      6    5
2018-06-04  11900  11900  12200  11700   25171  2018      6    4
2018-06-01  11900  11800  12100  11750   32062  2018      6    1

In [37]:
# 이거 왜 안될까?
df_ymd_range = df['2018-06-29':'2018-06-26']
df_ymd_range=df['2018-06-25':'2018-06-29']

df_ymd_range

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [38]:
# Time Series Basics
import numpy as np
import pandas as pd

from datetime import datetime
dates = [datetime(2011,1,2),datetime(2011,1,5),
         datetime(2011,1,7),datetime(2011,1,8),
         datetime(2011,1,10),datetime(2011,1,12)]
ts = pd.Series(np.random.randn(6),index=dates)
ts

# 날짜별로 숫자들을 랜덤하게 뽑은 것.

2011-01-02   -0.620767
2011-01-05   -0.395030
2011-01-07    0.598889
2011-01-08    0.855693
2011-01-10   -0.017100
2011-01-12    0.306319
dtype: float64

In [39]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [40]:
ts[::2]

2011-01-02   -0.620767
2011-01-07    0.598889
2011-01-10   -0.017100
dtype: float64

In [41]:
# 날짜별로 값 연산
ts + ts[::2]

2011-01-02   -1.241534
2011-01-05         NaN
2011-01-07    1.197778
2011-01-08         NaN
2011-01-10   -0.034201
2011-01-12         NaN
dtype: float64

In [42]:
ts.add(ts[::2], fill_value=0)

2011-01-02   -1.241534
2011-01-05   -0.395030
2011-01-07    1.197778
2011-01-08    0.855693
2011-01-10   -0.034201
2011-01-12    0.306319
dtype: float64

In [43]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [44]:
# indexing, Selection, Substting
stamp = ts.index[2]
ts[stamp]

0.59888918262748

In [45]:
# 2011-01-10 -1.008091
# 판다스는 날짜 형식을 넣어주지 않아도 그냥 해줌. 파이썬은 %Y이런거 해줬어야 했는데
print(ts['1/10/2011'])
ts['20110110']

-0.017100254547738194

-0.017100254547738194

In [5]:
import pandas as pd
import numpy as np
longer_ts = pd.Series(np.random.randn(1000),
                      index=pd.date_range('1/1/2000',periods=1000))
a = pd.DataFrame(longer_ts)
a

                   0
2000-01-01 -0.646732
2000-01-02  0.961847
2000-01-03  0.362343
2000-01-04 -2.996490
2000-01-05 -1.094328
...              ...
2002-09-22 -0.837520
2002-09-23  0.835591
2002-09-24  1.671226
2002-09-25 -1.184880
2002-09-26  0.445529

[1000 rows x 1 columns]

In [47]:
longer_ts['2001']

2001-01-01   -0.427330
2001-01-02    0.852119
2001-01-03    1.214739
2001-01-04   -0.018000
2001-01-05   -0.394714
                ...
2001-12-27   -0.225084
2001-12-28    0.104127
2001-12-29    0.015393
2001-12-30    1.708647
2001-12-31    1.228800
Freq: D, Length: 365, dtype: float64

In [48]:
longer_ts['2001-05'][:5]

2001-05-01    0.869532
2001-05-02   -0.858908
2001-05-03    0.288381
2001-05-04   -0.182394
2001-05-05    0.594881
Freq: D, dtype: float64

In [49]:
ts

2011-01-02   -0.620767
2011-01-05   -0.395030
2011-01-07    0.598889
2011-01-08    0.855693
2011-01-10   -0.017100
2011-01-12    0.306319
dtype: float64

In [50]:
ts[datetime(2011,1,7):]

2011-01-07    0.598889
2011-01-08    0.855693
2011-01-10   -0.017100
2011-01-12    0.306319
dtype: float64

In [51]:
ts

2011-01-02   -0.620767
2011-01-05   -0.395030
2011-01-07    0.598889
2011-01-08    0.855693
2011-01-10   -0.017100
2011-01-12    0.306319
dtype: float64

In [54]:
# truncate : 만약 truntime이 datetime values만 갖고 있다면 befor, after가 timestamps틀 대신해 str을 특정할수잇다.
print(ts.truncate(before='2011-01-05',after='2011-01-07'))

2011-01-05   -0.395030
2011-01-07    0.598889
dtype: float64

In [55]:
print(ts.truncate(after='1/9/2011'))  #이 날짜 이전게 나옴

2011-01-02   -0.620767
2011-01-05   -0.395030
2011-01-07    0.598889
2011-01-08    0.855693
dtype: float64

In [ ]:
pd.date_range('2020-10-7','2020-10-20')

시계열 함수 정리 링크 https://predictors.tistory.com/26

In [56]:
from datetime import datetime
from datetime import timedelta
now = datetime.now()
in_two_weeks = now + timedelta(weeks=2)

pd.date_range(datetime.now(),in_two_weeks)

DatetimeIndex(['2021-07-20 16:38:39.370225', '2021-07-21 16:38:39.370225',
               '2021-07-22 16:38:39.370225', '2021-07-23 16:38:39.370225',
               '2021-07-24 16:38:39.370225', '2021-07-25 16:38:39.370225',
               '2021-07-26 16:38:39.370225', '2021-07-27 16:38:39.370225',
               '2021-07-28 16:38:39.370225', '2021-07-29 16:38:39.370225',
               '2021-07-30 16:38:39.370225', '2021-07-31 16:38:39.370225',
               '2021-08-01 16:38:39.370225', '2021-08-02 16:38:39.370225'],
              dtype='datetime64[ns]', freq='D')

In [59]:
# 구간이 4개고, 기간이 5개인 것. 기간 사이사이가 4개니까. 
# periods 매개변수는 date_range 함수에 전달된 시작 날짜와 종료 날짜를 periods 매개변수에 전달된 기간만큼 동일하게
# 나누어 출력해준다. 
pd.date_range(start='2020-10-01', end='2020-10-20',periods=5)

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [60]:
pd.date_range('2021-05-02 12:56:31',periods=5, normalize=True) #날자만출력하고싶을떄

DatetimeIndex(['2021-05-02', '2021-05-03', '2021-05-04', '2021-05-05',
               '2021-05-06'],
              dtype='datetime64[ns]', freq='D')

req 매개변수에 사용되는 Frequncy strings
- A >> calendar year end frequency
- B	>> business day frequency
- C	>> custom business day frequency
- D	>> calendar day frequency
- W	>> weekly frequency
- M	>> month end frequency
- SM >> semi-month end frequency (15th and end of month)
- BM >> business month end frequency
- CBM >> custom business month end frequency
- MS >> month start frequency
- SMS >> semi-month start frequency (1st and 15th)
- BMS >> business month start frequency
- CBMS >> custom business month start frequency
- Q >> quarter end frequency

In [61]:
import numpy as np
dates=pd.date_range('1/1/2000',periods=100, freq='W-WED')
print(dates)

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13', '2000-12-20', '2000-12-27',
               '2001-01-03', '2001-01-10', '2001-01-17', '2001-01-24',
               '2001-01-31', '2001-02-07', '2001-02-14', '2001-02-21',
               '2001-02-28', '2001-03-07', '2001-03-14', '2001-03-21',
               '2001-03-28', '2001-04-04', '2001-04-11', '2001-04-18',
               '2001-04-25', '2001-05-02', '2001-05-09', '2001-05-16',
               '2001-05-23', '2001-05-30', '2001-06-06', '2001-06-13',
               '2001-06-20', '2001-06-27', '2001-07-04', '2001-07-11',
               '2001-07-18', '2001-07-25', '2001-08-01', '2001-08-08',
               '2001-08-15', '2001-08-22', '2001-08-29', '2001-09-05',
               '2001-09-12', '2001-09-19', '2001-09-26', '2001-10-03',
               '2001-10-10', '2001-10-17', '2001-10-24', '2001-10-31',
               '2001-11-07', '2001-11-14', '2001-11-21', '2001-11-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [62]:
long_df=pd.DataFrame(np.random.randn(100,4),
                    index=dates,
                    columns=['Colorado','Texas','New York','Ohio'])
print(long_df,'\n')
long_df.loc['2001-06']

            Colorado     Texas  New York      Ohio
2000-01-05  0.028941  2.114763 -0.297680  1.085177
2000-01-12 -0.190951  0.085452  0.623652 -0.336886
2000-01-19 -0.056300 -0.981705 -0.508960 -1.039107
2000-01-26 -0.616409  0.125728  1.453053 -0.212756
2000-02-02 -0.237486  0.203865 -0.688504 -0.785198
...              ...       ...       ...       ...
2001-10-31 -0.352172 -1.802022 -0.717194  0.106493
2001-11-07 -0.928485 -0.141763  0.796983  0.069176
2001-11-14  0.747939 -0.534666 -0.453478 -0.612855
2001-11-21  0.017064 -1.264910 -0.389205  0.081601
2001-11-28  1.415932  0.310045  0.387174  0.242674

[100 rows x 4 columns]

            Colorado     Texas  New York      Ohio
2001-06-06  0.240313  0.127911 -0.297794  1.074502
2001-06-13 -0.073316 -0.382929  1.287291 -1.734592
2001-06-20 -2.401007  0.133947 -0.134059  0.325046
2001-06-27 -1.641867 -1.078144 -0.909216 -0.812382

In [63]:
dates = pd.DatetimeIndex(['1/1/2000','1/2/2000','1/2/2000','1/2/2000',
                         '1/3/2000'])

dup_ts=pd.Series(np.arange(5),index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int64

In [64]:
dup_ts.index.is_unique #2가 3개나 있어서 false나옴. is_unique는 index의 중복여부를 알려준다.

False

내가 따로 알아본 내용>>  
브로드캐스팅(Broadcasting)이란,  
시리즈나 데이터 프레임에 있는 모든 데이터에 대해 한번에 연산하는 것을 말합니다.  
벡터는 시리즈처럼 여러 개의 값을 가진 데이터를, 스칼라는 단순 크기를 나타내는 데이터를 말하는데  

백터와 스칼라의 브로드캐스팅을 수행하는 경우를 보면  

① 같은 길이의 벡터로 더하기(+) 및 곱하기(*)를 수행하는 경우 같은 크기의 벡터가 출력됩니다.  
② 벡터에 스클라를 연산하면 그대로 수행합니다.  
③ 길이가 서로 다른 벡터를 연산하는 경우, 일치하는 인덱스의 값만 계산하고, 나머지는 누락 값(NaN) 처리됩니다.

In [65]:
dup_ts['1/3/2000'] #not duplicated의 경우 스칼라 값 - 1/3/2000의 경우 유니크하기 때문

4

In [66]:
dup_ts['1/2/2000'] #duplicated의 경우, 슬라이스 출력 - 1/2/2000경우 duplicated이기 때문

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int64

In [67]:
grouped =dup_ts.groupby(level=0)
print(grouped.mean())
grouped.count()

2000-01-01    0.0
2000-01-02    2.0
2000-01-03    4.0
dtype: float64

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [68]:
pd.date_range('2000-01-01','2000-01-03 23:59', freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [69]:
from pandas.tseries.offsets import Hour, Minute
Hour(2)+Minute(30)

In [70]:
pd.date_range('2000-01-01',periods=10,freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [71]:
rng=pd.date_range('2020-01-01','2021-09-01',freq='WOM-3FRI') #week of month, 매월셋째주 금요일
print(rng)

DatetimeIndex(['2020-01-17', '2020-02-21', '2020-03-20', '2020-04-17',
               '2020-05-15', '2020-06-19', '2020-07-17', '2020-08-21',
               '2020-09-18', '2020-10-16', '2020-11-20', '2020-12-18',
               '2021-01-15', '2021-02-19', '2021-03-19', '2021-04-16',
               '2021-05-21', '2021-06-18', '2021-07-16', '2021-08-20'],
              dtype='datetime64[ns]', freq='WOM-3FRI')

In [77]:
from pandas.tseries.offsets import Day, MonthEnd  #각월별 마지막 날짜
now = datetime(2011,11,17)
now+3*Day()

Timestamp('2011-11-20 00:00:00')

In [83]:
offset=MonthEnd()

print(offset.rollforward(now))
offset.rollback(now)

Timestamp('2011-10-31 00:00:00')

In [ ]:
# 과제
# Q. offset.rollforward 기준으로 그룹화를 진행 후 그룹별 평균값을 출력하세요.

In [ ]:
# 과제
# Q.상기 문제를 resample을 사용하여 수행하세요.

In [ ]:
# 과제
# Q.날짜 데이터를 인덱스로 하는 5가지 이상의 컬럼을 포함하고 있는 데이터셋을 생성하세요.
# 단, 각 컬럼은 인덱스별 의미있는 값을 갖도록 만든 후 다음을 수행하세요
# 1) 특정 연별,월별,일별,특정 컬럼 값 집계
# 2) 인덱스를 실수형으로 변환 후 다시 datetime으로 변환
# 3) 인덱스의 포멧을 변환

## 7/21 수업

In [90]:
# Periods and Period Arithmetic
import pandas as pd
p= pd.Period(2007,freq='A-DEC')
print(p+5)  #2007년 말 + 5년

2012

In [91]:
p-2 #2005년 말

Period('2005', 'A-DEC')

In [92]:
# 기간을 타임스탬프로 변환
import numpy as np
rng=pd.period_range('2000-01-01','2000-03-31', freq='M')
ts = pd.Series(np.random.randn(3),index=rng)
print(ts, '\n')
ts.to_timestamp(how='end')

2000-01   -0.664983
2000-02    0.588964
2000-03    1.369522
Freq: M, dtype: float64

2000-01-31 23:59:59.999999999   -0.664983
2000-02-29 23:59:59.999999999    0.588964
2000-03-31 23:59:59.999999999    1.369522
dtype: float64

아래 참고
https://www.google.com/search?q=%EB%8B%AB%ED%9E%8C+%EA%B5%AC%EA%B0%84&newwindow=1&ei=l2z3YNrGK6LfmAWCoYCYDQ&oq=%EB%8B%AB%ED%9E%8C+%EA%B5%AC%EA%B0%84&gs_lcp=Cgdnd3Mtd2l6EAMyAggAMgIIADICCAAyBAgAEB4yBAgAEB4yBAgAEB4yBggAEAUQHjIGCAAQBRAeMggIABAIEAoQHjoICAAQsQMQgwE6BQgAELEDOgQIABAKOgYIABAKECo6BwgAELEDEApKBAhBGABQoIaFAVjNloUBYNGXhQFoA3AAeAGAAZkCiAGtD5IBBjEuMTQuMZgBAKABAaoBB2d3cy13aXqwAQDAAQE&sclient=gws-wiz&ved=0ahUKEwia7vel9vLxAhWiL6YKHYIQANMQ4dUDCA4&uact=5

In [94]:
ts.resample('5min', closed='right').sum() #다음것부터 출력이라 전에것도 나옴, 닫힌구간 열린구간 생각해보길
#4개씩 더한 것.

2000-12-31 23:55:00     0
2001-01-01 00:00:00    15
2001-01-01 00:05:00    40
2001-01-01 00:10:00    11
Freq: 5T, dtype: int64

In [95]:
ts.resample('5min').ohlc() #주식쪽 데이터 그냥 참고~

                     open  high  low  close
2001-01-01 00:00:00     0     4    0      4
2001-01-01 00:05:00     5     9    5      9
2001-01-01 00:10:00    10    11   10     11

In [96]:
frame = pd.DataFrame(np.random.randn(2,4),
                     index=pd.date_range('1/1/2000',periods=2, freq='W-WED'),
                     columns=['Colorado','Texas','New York','Ohio'])

df_daily = frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.766281 -0.578124  1.333864  0.443282

In [97]:
frame.resample('D').ffill()  #frontfill - 앞에있는걸로 채워짐/ bfill도 있음

            Colorado     Texas  New York      Ohio
2000-01-05 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-06 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-07 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-08 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-09 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-10 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-11 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-12  0.766281 -0.578124  1.333864  0.443282

In [98]:
frame.resample('D').ffill(limit=2) #2개만 채우고 싶을 때

            Colorado     Texas  New York      Ohio
2000-01-05 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-06 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-07 -3.098964 -0.780242 -0.192123 -0.724218
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.766281 -0.578124  1.333864  0.443282